package com.hhly.ticket.service.ticket.dealer.hongzhan;

import java.util.HashMap;
import java.util.Map;

import org.apache.commons.lang.StringUtils;


public abstract class HongZhanUtil {
	// 出票商返回错误编码代表信息
	private static Map<String, String> ERROR_MESSAGE = new HashMap<String, String>() {
		private static final long serialVersionUID = 8652786328592974668L;

		{
			put("0","成功");
			put("8888","代理商余额不足");
			put("9999","系统维护中");
			put("10000","代理权限不足，不能执行此操作");
			put("10003","用户名已经存在(这个版本中不存在此错误)");
			put("10010","账户金额不足,无法完成此操作");
			put("10014","无效的渠道号");
			put("10018","交易通讯超时..");
			put("10019","参数过长");
			put("10032","交易已存在");
			put("12901","无效或者不完整XML数据格式");
			put("12902","要查询的数据还未开奖，请等开奖后再查");
			put("12903","传入参数信息错误");
			put("12904","一次提交数据过多！");
			put("14000","系统目前不支持此玩法");
			put("14001","操作代码格式错误");
			put("14002","注数计算错误(竞彩：彩果需要用()包裹，也有可能是串关设置的无效串关(childtype))");
			put("14003","投注金额计算错误(竞彩：批次号与对阵编号没有用-分隔符)");
			put("14004","玩法已期结，无法完成本次投注(竞彩：批次号长度不对，足彩为150101蓝彩为20150101)");
			put("14005","一票超过20000元限(竞彩：彩果格式不对，比如：蓝彩胜（3），负(0),如果写成其它值，则错误。复选时，要用\",\"号隔开)");
			put("14029","指定的交易不存在");
			put("14030","数据安全验证失败");
			put("14009","串关与对阵数量不符");
			put("14007","混串玩法分隔符^格式不对，如果不是混串，则投注代码中不能出现此字符");
			put("14008","所选对阵状态不对，1、可能无效的对阵，2可能已经停止投注（目前15分钟）;对阵请参考竞猜网");
			put("14006","对阵有问题，可能在一次投注中包含了两个同样的对阵场次");
			
			put("100001","程序错误");
			put("100002","解码错误");
			put("100003","无效参数（报警）");
			put("100004","系统异常（可在投）");
			put("100005","无效帐户");
			put("100006","执行错误");
			put("100007","不支持的接口");
			put("100008","系统维护");
			put("200001","投注金余额不足");
			put("200002","注码格式错误");
			put("200003","投注序列号重复");
			put("200004","消息序列号重复");
			put("200005","无效玩法代码");
			put("200006","玩法未开期");
			put("200007","玩法已经封期");
			put("200008","投注额度满");
			put("200009","限号/球队暂停销售");
			put("200010","无此投注序列号");
			put("200020","出票失败");
			put("200021","还未出票");
			put("200022","无此消息序列号");
			put("200023","已提交成功");
			put("200024","已提交失败");
			put("200025","未开奖");
			put("200100","订单号重复");
			put("200101","无此订单号");
			put("200102","人工控制");
			put("200103","已经结账");
			put("200104","无效IDC号");
			put("200200","未出票");
			put("200201","准备出票");
			put("200202","成功");
			put("200203","限号");
			put("200204","出票失败");
			put("300001","出票失败(数据库)");
		}
	};

	/**
	 * 获取出票商返回错误编码解释
	 * 
	 * @author jiangwei
	 * @Version 1.0
	 * @CreatDate 2017年8月1日 下午4:13:46
	 * @param code
	 * @return
	 */
	public static String getErrorMessage(String code) {
		if (StringUtils.isBlank(code)) {
			return code;
		}
		String msg = ERROR_MESSAGE.get(code.trim());
		return msg == null ? "出票商不存在解释" : msg;
	}
}
